####################################################
###     run for different parameter schemes      ###
####################################################

##### case 100-120 s=3 ##################

n <- 100 #100 200 500 1000 50
r <- 120 #50 100 200
r1 <- 5

s <- 6 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())

##### case 100-120 s=3 ##################

n <- 100 #100 200 500 1000 50
r <- 120 #50 100 200
r1 <- 5

s <- 8 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())

##### case 100-120 s=3 ##################

n <- 100 #100 200 500 1000 50
r <- 120 #50 100 200
r1 <- 5

s <- 13 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())

##### case 100-120 s=3 ##################

n <- 200 #100 200 500 1000 50
r <- 240 #50 100 200
r1 <- 5

s <- 6 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())

##### case 100-120 s=3 ##################

n <- 200 #100 200 500 1000 50
r <- 240 #50 100 200
r1 <- 5

s <- 12 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())

##### case 100-120 s=3 ##################

n <- 200 #100 200 500 1000 50
r <- 240 #50 100 200
r1 <- 5

s <- 17 # log(n)

rep.num <- 500

beta <- c(0.5, -2) 

#运行主程序
source("HDMS_HHD_CI.R")

rm(list=ls())








